'''
# 默认格式
# {}中的数字表示format函数中的参数序号(从0开始),默认情况可以不用填写数字,\t相当于tab
pattern = "{0}\t{1}\t{2}\t{3}\t{4}\t{5}"
print(pattern.format("金种","实时主动积存价格","最低价","最高价","定期积存价","更新时间"))
print(pattern.format("积存金",372.73,372.73,372.73,366.10,"2021-08-15 00:18:04"))
'''


'''
对齐方式：
- 居中对齐：^
- 靠右对齐：>
- 靠左对齐：<
占用宽度：使用数字表示，一般跟在对齐方式后面。比如{:<4}表示占用4个宽度单位并靠左对齐，若是占用的宽度未使用完则进行填充，默认使用英式空格填充。
'''
# 由于中文字的宽度大约是默认填充方式的2倍，所以写成如下格式, 冒号前面是索引, 后面是设置对齐方式和宽度
pattern = "{0:<4}\t{1:<16}\t{2:<8}\t{3:<8}\t{4:<10}\t{5:<8}"
print(pattern.format("金种","实时主动积存价格","最低价","最高价","定期积存价","更新时间"))
print(pattern.format("积存金",372.73,372.73,372.73,366.10,"2021-08-15 00:18:04"))
